In [2]:
import pandas as pd
import boto3
import sagemaker

sess = sagemaker.Session()
bucket = sess.default_bucket()
role = sagemaker.get_execution_role()
region = boto3.Session().region_name

In [3]:
database_name = "oneclickdb"

In [4]:
from pyathena import connect

In [5]:
# Set S3 staging directory -- this is a temporary directory used for Athena queries
s3_staging_dir = "s3://{0}/athena/staging".format(bucket)

In [6]:
%store -r ingest_create_athena_db_passed

In [7]:
private_s3_path_csv1 = "s3://{}/oneclickdata/aisles/".format(bucket)
print(private_s3_path_csv1)

s3://sagemaker-us-east-1-222711858116/oneclickdata/aisles/

In [8]:
private_s3_path_csv2 = "s3://{}/oneclickdata/departments/".format(bucket)
print(private_s3_path_csv2)

s3://sagemaker-us-east-1-222711858116/oneclickdata/departments/

In [9]:
private_s3_path_csv3= "s3://{}/oneclickdata/prior/".format(bucket)
print(private_s3_path_csv3)

s3://sagemaker-us-east-1-222711858116/oneclickdata/prior/

In [10]:
private_s3_path_csv4= "s3://{}/oneclickdata/train/".format(bucket)
print(private_s3_path_csv4)

s3://sagemaker-us-east-1-222711858116/oneclickdata/train/

In [11]:
private_s3_path_csv5 = "s3://{}/oneclickdata/orders/".format(bucket)
print(private_s3_path_csv5)

s3://sagemaker-us-east-1-222711858116/oneclickdata/orders/

In [12]:
private_s3_path_csv6 = "s3://{}/oneclickdata/products/".format(bucket)
print(private_s3_path_csv6)

s3://sagemaker-us-east-1-222711858116/oneclickdata/products/

In [13]:
# Set Athena parameters
table_1 = "aisles_tab"
table_2= "departments_tab"
table_3= "order_prior_tab"
table_4= "order_train_tab"
table_5= "orders_tab"
table_6= "products_tab"

In [14]:
conn = connect(region_name=region, s3_staging_dir=s3_staging_dir)

In [15]:
# SQL statement to execute aisles table
statement1 = """CREATE EXTERNAL TABLE IF NOT EXISTS {}.{}(
         aisle_id int,
         aisle string
       
) ROW FORMAT DELIMITED
FIELDS TERMINATED BY ',' 
LINES TERMINATED BY '\n'
LOCATION '{}'
TBLPROPERTIES ('skip.header.line.count'='1')""".format(
    database_name, table_1, private_s3_path_csv1
)


pd.read_sql(statement1, conn)


# drop1= "DROP TABLE oneclickaws.aisles"
# pd.read_sql(drop1, conn)

# drop2= "DROP TABLE oneclickaws.departments"
# pd.read_sql(drop2, conn)

# drop3= "DROP TABLE oneclickaws.order_products__prior"
# pd.read_sql(drop3, conn)

# drop4= "DROP TABLE oneclickaws.order_products__train"
# pd.read_sql(drop4, conn)

# drop5= "DROP TABLE oneclickaws.orders"
# pd.read_sql(drop5, conn)

# drop5= "DROP TABLE oneclickaws.products"
# pd.read_sql(drop5, conn)

Empty DataFrame
Columns: []
Index: []

In [16]:
# SQL statement to execute department table
statement2 = """CREATE EXTERNAL TABLE IF NOT EXISTS {}.{}(
         department_id int,
         department string
       
) ROW FORMAT DELIMITED
FIELDS TERMINATED BY ',' 
LINES TERMINATED BY '\n'
LOCATION '{}'
TBLPROPERTIES ('skip.header.line.count'='1')""".format(
    database_name, table_2, private_s3_path_csv2
)


pd.read_sql(statement2, conn)

Empty DataFrame
Columns: []
Index: []

In [17]:
# SQL statement to execute order_products__prior table
statement3 = """CREATE EXTERNAL TABLE IF NOT EXISTS {}.{}(
         order_id int,
         product_id int,
         add_to_cart_order int,
         reordered string
       
) ROW FORMAT DELIMITED
FIELDS TERMINATED BY ',' 
LINES TERMINATED BY '\n'
LOCATION '{}'
TBLPROPERTIES ('skip.header.line.count'='1')""".format(
    database_name, table_3, private_s3_path_csv3
)


pd.read_sql(statement3, conn)

Empty DataFrame
Columns: []
Index: []

In [18]:
# SQL statement to execute order_products__train table
statement4 = """CREATE EXTERNAL TABLE IF NOT EXISTS {}.{}(
         order_id int,
         product_id int,
         add_to_cart_order int,
         reordered string
       
) ROW FORMAT DELIMITED
FIELDS TERMINATED BY ',' 
LINES TERMINATED BY '\n'
LOCATION '{}'
TBLPROPERTIES ('skip.header.line.count'='1')""".format(
    database_name, table_4, private_s3_path_csv4
)


pd.read_sql(statement4, conn)

Empty DataFrame
Columns: []
Index: []

In [19]:
# SQL statement to execute orders table
statement5 = """CREATE EXTERNAL TABLE IF NOT EXISTS {}.{}(
         order_id int,
         user_id int,
         eval_set string,
         order_number int,
         order_dow string,
         order_hour_of_day string,
         days_since_prior_order float
       
) ROW FORMAT DELIMITED
FIELDS TERMINATED BY ',' 
LINES TERMINATED BY '\n'
LOCATION '{}'
TBLPROPERTIES ('skip.header.line.count'='1')""".format(
    database_name, table_5, private_s3_path_csv5
)


pd.read_sql(statement5, conn)

Empty DataFrame
Columns: []
Index: []

In [20]:
# SQL statement to execute products table
statement6= """CREATE EXTERNAL TABLE IF NOT EXISTS {}.{}(
          product_id int,
         product_name string,
         aisle_id int,
         department_id int
) ROW FORMAT DELIMITED
FIELDS TERMINATED BY ',' 
LINES TERMINATED BY '\n'
LOCATION '{}'
TBLPROPERTIES ('skip.header.line.count'='1')""".format(
    database_name, table_6, private_s3_path_csv6
)


pd.read_sql(statement6, conn)

Empty DataFrame
Columns: []
Index: []

In [21]:
statement = "SHOW TABLES in {}".format(database_name)

df_show = pd.read_sql(statement, conn)
df_show.head(6)

          tab_name
0       aisles_tab
1  departments_tab
2  order_prior_tab
3  order_train_tab
4       orders_tab
5     products_tab

In [22]:
test_statement = """SELECT * FROM {}.{} LIMIT 5 """.format(
    database_name, table_1
)

print(test_statement)
df_show = pd.read_sql(test_statement, conn)
df_show.head(5)

SELECT * FROM oneclickdb.aisles_tab LIMIT 5

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [23]:
test_statement = """SELECT * FROM {}.{} LIMIT 5 """.format(
    database_name, table_2
)

print(test_statement)
df_show = pd.read_sql(test_statement, conn)
df_show.head(5)

SELECT * FROM oneclickdb.departments_tab LIMIT 5

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [24]:
test_statement = """SELECT * FROM {}.{} LIMIT 10 """.format(
    database_name, table_3
)

print(test_statement)
df_show = pd.read_sql(test_statement, conn)
df_show.head(10)

SELECT * FROM oneclickdb.order_prior_tab LIMIT 10

   order_id  product_id  add_to_cart_order reordered
0   3184639       25340                  1         1
1   3184639       17902                  2         1
2   3184639       45007                  3         1
3   3184639        8518                  4         1
4   3184639       22935                  5         1
5   3184639        4288                  6         1
6   3184639        6046                  7         1
7   3184639        5991                  8         1
8   3184639       21903                  9         1
9   3184639       34243                 10         1

In [25]:
test_statement = """SELECT * FROM {}.{} LIMIT 10 """.format(
    database_name, table_4
)

print(test_statement)
df_show = pd.read_sql(test_statement, conn)
df_show.head(10)

SELECT * FROM oneclickdb.order_train_tab LIMIT 10

   order_id  product_id  add_to_cart_order reordered
0         1       49302                  1         1
1         1       11109                  2         1
2         1       10246                  3         0
3         1       49683                  4         0
4         1       43633                  5         1
5         1       13176                  6         0
6         1       47209                  7         0
7         1       22035                  8         1
8        36       39612                  1         0
9        36       19660                  2         1

In [26]:
test_statement = """SELECT * FROM {}.{} LIMIT 10 """.format(
    database_name, table_5
)

print(test_statement)
df_show = pd.read_sql(test_statement, conn)
df_show.head(10)

SELECT * FROM oneclickdb.orders_tab LIMIT 10

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2140650,64753,prior,14,4,20,3.0
1,1214639,64753,prior,15,1,14,4.0
2,217815,64753,prior,16,3,09,9.0
3,1704690,64753,prior,17,1,16,5.0
4,663202,64753,prior,18,3,13,2.0
5,173680,64753,prior,19,6,17,3.0
6,141188,64753,prior,20,6,13,7.0
7,1408778,64753,prior,21,3,17,18.0
8,1798135,64753,prior,22,6,14,30.0
9,1581454,64753,prior,23,0,09,8.0

In [27]:
test_statement = """SELECT * FROM {}.{} LIMIT 10 """.format(
    database_name, table_6
)

print(test_statement)
df_show = pd.read_sql(test_statement, conn)
df_show.head(10)

SELECT * FROM oneclickdb.products_tab LIMIT 10

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13
5,6,Dry Nose Oil,11,11
6,7,Pure Coconut Water With Orange,98,7
7,8,Cut Russet Potatoes Steam N' Mash,116,1
8,9,Light Strawberry Blueberry Yogurt,120,16
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7